MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2H46G0AGB3000A/mcu.h
        struct {
          union {
            __IO uint16_t IRQ037MONL;
            struct {
              __IO uint8_t IRQ037MONLL;
              __IO uint8_t IRQ037MONLH;
            };
          };
          union {
            __IO uint16_t IRQ037MONH;
            struct {
              __IO uint8_t IRQ037MONHL;
              __IO uint8_t IRQ037MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ038MON;
        stc_intreq_irq038mon_field_t IRQ038MON_f;
        struct {
          union {
            __IO uint16_t IRQ038MONL;
            struct {
              __IO uint8_t IRQ038MONLL;
              __IO uint8_t IRQ038MONLH;
            };
          };
          union {
            __IO uint16_t IRQ038MONH;
            struct {
              __IO uint8_t IRQ038MONHL;
              __IO uint8_t IRQ038MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ039MON;
        stc_intreq_irq039mon_field_t IRQ039MON_f;
        struct {
          union {
            __IO uint16_t IRQ039MONL;
            struct {
              __IO uint8_t IRQ039MONLL;
              __IO uint8_t IRQ039MONLH;
            };
          };
          union {
            __IO uint16_t IRQ039MONH;
            struct {
              __IO uint8_t IRQ039MONHL;
              __IO uint8_t IRQ039MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ040MON;
        stc_intreq_irq040mon_field_t IRQ040MON_f;
        struct {
          union {
            __IO uint16_t IRQ040MONL;
            struct {
              __IO uint8_t IRQ040MONLL;
              __IO uint8_t IRQ040MONLH;
            };
          };
          union {
            __IO uint16_t IRQ040MONH;
            struct {
              __IO uint8_t IRQ040MONHL;
              __IO uint8_t IRQ040MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ041MON;
        stc_intreq_irq041mon_field_t IRQ041MON_f;
        struct {
          union {
            __IO uint16_t IRQ041MONL;
            struct {
              __IO uint8_t IRQ041MONLL;
              __IO uint8_t IRQ041MONLH;
            };
          };
          union {
            __IO uint16_t IRQ041MONH;
            struct {
              __IO uint8_t IRQ041MONHL;
              __IO uint8_t IRQ041MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ042MON;
        stc_intreq_irq042mon_field_t IRQ042MON_f;
        struct {
          union {
            __IO uint16_t IRQ042MONL;
            struct {
              __IO uint8_t IRQ042MONLL;
              __IO uint8_t IRQ042MONLH;
            };
          };
          union {
            __IO uint16_t IRQ042MONH;
            struct {
              __IO uint8_t IRQ042MONHL;
              __IO uint8_t IRQ042MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ043MON;
        stc_intreq_irq043mon_field_t IRQ043MON_f;
        struct {
          union {
            __IO uint16_t IRQ043MONL;
            struct {
              __IO uint8_t IRQ043MONLL;
              __IO uint8_t IRQ043MONLH;
            };
          };
          union {
            __IO uint16_t IRQ043MONH;
            struct {
              __IO uint8_t IRQ043MONHL;
              __IO uint8_t IRQ043MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ044MON;
        stc_intreq_irq044mon_field_t IRQ044MON_f;
        struct {
          union {
            __IO uint16_t IRQ044MONL;
            struct {
              __IO uint8_t IRQ044MONLL;
              __IO uint8_t IRQ044MONLH;
            };
          };
          union {
            __IO uint16_t IRQ044MONH;
            struct {
              __IO uint8_t IRQ044MONHL;
              __IO uint8_t IRQ044MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ045MON;
        stc_intreq_irq045mon_field_t IRQ045MON_f;
        struct {
          union {
            __IO uint16_t IRQ045MONL;
            struct {
              __IO uint8_t IRQ045MONLL;
              __IO uint8_t IRQ045MONLH;
            };
          };
          union {
            __IO uint16_t IRQ045MONH;
            struct {
              __IO uint8_t IRQ045MONHL;
              __IO uint8_t IRQ045MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ046MON;
        stc_intreq_irq046mon_field_t IRQ046MON_f;
        struct {
          union {
            __IO uint16_t IRQ046MONL;
            struct {
              __IO uint8_t IRQ046MONLL;
              __IO uint8_t IRQ046MONLH;
            };
          };
          union {
            __IO uint16_t IRQ046MONH;
            struct {
              __IO uint8_t IRQ046MONHL;
              __IO uint8_t IRQ046MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ047MON;
        stc_intreq_irq047mon_field_t IRQ047MON_f;
        struct {
          union {
            __IO uint16_t IRQ047MONL;
            struct {
              __IO uint8_t IRQ047MONLL;
              __IO uint8_t IRQ047MONLH;
            };
          };
          union {
            __IO uint16_t IRQ047MONH;
            struct {
              __IO uint8_t IRQ047MONHL;
              __IO uint8_t IRQ047MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ048MON;
        stc_intreq_irq048mon_field_t IRQ048MON_f;
        struct {
          union {
            __IO uint16_t IRQ048MONL;
            struct {
              __IO uint8_t IRQ048MONLL;
              __IO uint8_t IRQ048MONLH;
            };
          };
          union {
            __IO uint16_t IRQ048MONH;
            struct {
              __IO uint8_t IRQ048MONHL;
              __IO uint8_t IRQ048MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ049MON;
        stc_intreq_irq049mon_field_t IRQ049MON_f;
        struct {
          union {
            __IO uint16_t IRQ049MONL;
            struct {
              __IO uint8_t IRQ049MONLL;
              __IO uint8_t IRQ049MONLH;
            };
          };
          union {
            __IO uint16_t IRQ049MONH;
            struct {
              __IO uint8_t IRQ049MONHL;
              __IO uint8_t IRQ049MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ050MON;
        stc_intreq_irq050mon_field_t IRQ050MON_f;
        struct {
          union {
            __IO uint16_t IRQ050MONL;
            struct {
              __IO uint8_t IRQ050MONLL;
              __IO uint8_t IRQ050MONLH;
            };
          };
          union {
            __IO uint16_t IRQ050MONH;
            struct {
              __IO uint8_t IRQ050MONHL;
              __IO uint8_t IRQ050MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ051MON;
        stc_intreq_irq051mon_field_t IRQ051MON_f;
        struct {
          union {
            __IO uint16_t IRQ051MONL;
            struct {
              __IO uint8_t IRQ051MONLL;
              __IO uint8_t IRQ051MONLH;
            };
          };
          union {
            __IO uint16_t IRQ051MONH;
            struct {
              __IO uint8_t IRQ051MONHL;
              __IO uint8_t IRQ051MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ052MON;
        stc_intreq_irq052mon_field_t IRQ052MON_f;
        struct {
          union {
            __IO uint16_t IRQ052MONL;
            struct {
              __IO uint8_t IRQ052MONLL;
              __IO uint8_t IRQ052MONLH;
            };
          };
          union {
            __IO uint16_t IRQ052MONH;
            struct {
              __IO uint8_t IRQ052MONHL;
              __IO uint8_t IRQ052MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ053MON;
        stc_intreq_irq053mon_field_t IRQ053MON_f;
        struct {
          union {
            __IO uint16_t IRQ053MONL;
            struct {
              __IO uint8_t IRQ053MONLL;
              __IO uint8_t IRQ053MONLH;
            };
          };
          union {
            __IO uint16_t IRQ053MONH;
            struct {
              __IO uint8_t IRQ053MONHL;
              __IO uint8_t IRQ053MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ054MON;
        stc_intreq_irq054mon_field_t IRQ054MON_f;
        struct {
          union {
            __IO uint16_t IRQ054MONL;
            struct {
              __IO uint8_t IRQ054MONLL;
              __IO uint8_t IRQ054MONLH;
            };
          };
          union {
            __IO uint16_t IRQ054MONH;
            struct {
              __IO uint8_t IRQ054MONHL;
              __IO uint8_t IRQ054MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ055MON;
        stc_intreq_irq055mon_field_t IRQ055MON_f;
        struct {
          union {
            __IO uint16_t IRQ055MONL;
            struct {
              __IO uint8_t IRQ055MONLL;
              __IO uint8_t IRQ055MONLH;
            };
          };
          union {
            __IO uint16_t IRQ055MONH;
            struct {
              __IO uint8_t IRQ055MONHL;
              __IO uint8_t IRQ055MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ056MON;
        stc_intreq_irq056mon_field_t IRQ056MON_f;
        struct {
          union {
            __IO uint16_t IRQ056MONL;
            struct {
              __IO uint8_t IRQ056MONLL;
              __IO uint8_t IRQ056MONLH;
            };
          };
          union {
            __IO uint16_t IRQ056MONH;
            struct {
              __IO uint8_t IRQ056MONHL;
              __IO uint8_t IRQ056MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ057MON;
        stc_intreq_irq057mon_field_t IRQ057MON_f;
        struct {
          union {
            __IO uint16_t IRQ057MONL;
            struct {
              __IO uint8_t IRQ057MONLL;
              __IO uint8_t IRQ057MONLH;
            };
          };
          union {
            __IO uint16_t IRQ057MONH;
            struct {
              __IO uint8_t IRQ057MONHL;
              __IO uint8_t IRQ057MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ058MON;
        stc_intreq_irq058mon_field_t IRQ058MON_f;
        struct {
          union {
            __IO uint16_t IRQ058MONL;
            struct {
              __IO uint8_t IRQ058MONLL;
              __IO uint8_t IRQ058MONLH;
            };
          };
          union {
            __IO uint16_t IRQ058MONH;
            struct {
              __IO uint8_t IRQ058MONHL;
              __IO uint8_t IRQ058MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ059MON;
        stc_intreq_irq059mon_field_t IRQ059MON_f;
        struct {
          union {
            __IO uint16_t IRQ059MONL;
            struct {
              __IO uint8_t IRQ059MONLL;
              __IO uint8_t IRQ059MONLH;
            };
          };
          union {
            __IO uint16_t IRQ059MONH;
            struct {
              __IO uint8_t IRQ059MONHL;
              __IO uint8_t IRQ059MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ060MON;
        stc_intreq_irq060mon_field_t IRQ060MON_f;
        struct {
          union {
            __IO uint16_t IRQ060MONL;
            struct {
              __IO uint8_t IRQ060MONLL;
              __IO uint8_t IRQ060MONLH;
            };
          };
          union {
            __IO uint16_t IRQ060MONH;
            struct {
              __IO uint8_t IRQ060MONHL;
              __IO uint8_t IRQ060MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ061MON;
        stc_intreq_irq061mon_field_t IRQ061MON_f;
        struct {
          union {
            __IO uint16_t IRQ061MONL;
            struct {
              __IO uint8_t IRQ061MONLL;
              __IO uint8_t IRQ061MONLH;
            };
          };
          union {
            __IO uint16_t IRQ061MONH;
            struct {
              __IO uint8_t IRQ061MONHL;
              __IO uint8_t IRQ061MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ062MON;
        stc_intreq_irq062mon_field_t IRQ062MON_f;
        struct {
          union {
            __IO uint16_t IRQ062MONL;
            struct {
              __IO uint8_t IRQ062MONLL;
              __IO uint8_t IRQ062MONLH;
            };
          };
          union {
            __IO uint16_t IRQ062MONH;
            struct {
              __IO uint8_t IRQ062MONHL;
              __IO uint8_t IRQ062MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ063MON;
        stc_intreq_irq063mon_field_t IRQ063MON_f;
        struct {
          union {
            __IO uint16_t IRQ063MONL;
            struct {
              __IO uint8_t IRQ063MONLL;
              __IO uint8_t IRQ063MONLH;
            };
          };
          union {
            __IO uint16_t IRQ063MONH;
            struct {
              __IO uint8_t IRQ063MONHL;
              __IO uint8_t IRQ063MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ064MON;
        stc_intreq_irq064mon_field_t IRQ064MON_f;
        struct {
          union {
            __IO uint16_t IRQ064MONL;
            struct {
              __IO uint8_t IRQ064MONLL;
              __IO uint8_t IRQ064MONLH;
            };
          };
          union {
            __IO uint16_t IRQ064MONH;
            struct {
              __IO uint8_t IRQ064MONHL;
              __IO uint8_t IRQ064MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ065MON;
        stc_intreq_irq065mon_field_t IRQ065MON_f;
        struct {
          union {
            __IO uint16_t IRQ065MONL;
            struct {
              __IO uint8_t IRQ065MONLL;
              __IO uint8_t IRQ065MONLH;
            };
          };
          union {
            __IO uint16_t IRQ065MONH;
            struct {
              __IO uint8_t IRQ065MONHL;
              __IO uint8_t IRQ065MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ066MON;
        stc_intreq_irq066mon_field_t IRQ066MON_f;
        struct {
          union {
            __IO uint16_t IRQ066MONL;
            struct {
              __IO uint8_t IRQ066MONLL;
              __IO uint8_t IRQ066MONLH;
            };
          };
          union {
            __IO uint16_t IRQ066MONH;
            struct {
              __IO uint8_t IRQ066MONHL;
              __IO uint8_t IRQ066MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ067MON;
        stc_intreq_irq067mon_field_t IRQ067MON_f;
        struct {
          union {
            __IO uint16_t IRQ067MONL;
            struct {
              __IO uint8_t IRQ067MONLL;
              __IO uint8_t IRQ067MONLH;
            };
          };
          union {
            __IO uint16_t IRQ067MONH;
            struct {
              __IO uint8_t IRQ067MONHL;
              __IO uint8_t IRQ067MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ068MON;
        stc_intreq_irq068mon_field_t IRQ068MON_f;
        struct {
          union {
            __IO uint16_t IRQ068MONL;
            struct {
              __IO uint8_t IRQ068MONLL;
              __IO uint8_t IRQ068MONLH;
            };
          };
          union {
            __IO uint16_t IRQ068MONH;
            struct {
              __IO uint8_t IRQ068MONHL;
              __IO uint8_t IRQ068MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ069MON;
        stc_intreq_irq069mon_field_t IRQ069MON_f;
        struct {
          union {
            __IO uint16_t IRQ069MONL;
            struct {
              __IO uint8_t IRQ069MONLL;
              __IO uint8_t IRQ069MONLH;
            };
          };
          union {
            __IO uint16_t IRQ069MONH;
            struct {
              __IO uint8_t IRQ069MONHL;
              __IO uint8_t IRQ069MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ070MON;
        stc_intreq_irq070mon_field_t IRQ070MON_f;
        struct {
          union {
            __IO uint16_t IRQ070MONL;
            struct {
              __IO uint8_t IRQ070MONLL;
              __IO uint8_t IRQ070MONLH;
            };
          };
          union {
            __IO uint16_t IRQ070MONH;
            struct {
              __IO uint8_t IRQ070MONHL;
              __IO uint8_t IRQ070MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ071MON;
        stc_intreq_irq071mon_field_t IRQ071MON_f;
        struct {
          union {
            __IO uint16_t IRQ071MONL;
            struct {
              __IO uint8_t IRQ071MONLL;
              __IO uint8_t IRQ071MONLH;
            };
          };
          union {
            __IO uint16_t IRQ071MONH;
            struct {
              __IO uint8_t IRQ071MONHL;
              __IO uint8_t IRQ071MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ072MON;
        stc_intreq_irq072mon_field_t IRQ072MON_f;
        struct {
          union {
            __IO uint16_t IRQ072MONL;
            struct {
              __IO uint8_t IRQ072MONLL;
              __IO uint8_t IRQ072MONLH;
            };
          };
          union {
            __IO uint16_t IRQ072MONH;
            struct {
              __IO uint8_t IRQ072MONHL;
              __IO uint8_t IRQ072MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ073MON;
        stc_intreq_irq073mon_field_t IRQ073MON_f;
        struct {
          union {
            __IO uint16_t IRQ073MONL;
            struct {
              __IO uint8_t IRQ073MONLL;
              __IO uint8_t IRQ073MONLH;
            };
          };
          union {
            __IO uint16_t IRQ073MONH;
            struct {
              __IO uint8_t IRQ073MONHL;
              __IO uint8_t IRQ073MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ074MON;
        stc_intreq_irq074mon_field_t IRQ074MON_f;
        struct {
          union {
            __IO uint16_t IRQ074MONL;
            struct {
              __IO uint8_t IRQ074MONLL;
              __IO uint8_t IRQ074MONLH;
            };
          };
          union {
            __IO uint16_t IRQ074MONH;
            struct {
              __IO uint8_t IRQ074MONHL;
              __IO uint8_t IRQ074MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ075MON;
        stc_intreq_irq075mon_field_t IRQ075MON_f;
        struct {
          union {
            __IO uint16_t IRQ075MONL;
            struct {
              __IO uint8_t IRQ075MONLL;
              __IO uint8_t IRQ075MONLH;
            };
          };
          union {
            __IO uint16_t IRQ075MONH;
            struct {
              __IO uint8_t IRQ075MONHL;
              __IO uint8_t IRQ075MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ076MON;
        stc_intreq_irq076mon_field_t IRQ076MON_f;
        struct {
          union {
            __IO uint16_t IRQ076MONL;
            struct {
              __IO uint8_t IRQ076MONLL;
              __IO uint8_t IRQ076MONLH;
            };
          };
          union {
            __IO uint16_t IRQ076MONH;
            struct {
              __IO uint8_t IRQ076MONHL;
              __IO uint8_t IRQ076MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ077MON;
        stc_intreq_irq077mon_field_t IRQ077MON_f;
        struct {
          union {
            __IO uint16_t IRQ077MONL;
            struct {
              __IO uint8_t IRQ077MONLL;
              __IO uint8_t IRQ077MONLH;
            };
          };
          union {
            __IO uint16_t IRQ077MONH;
            struct {
              __IO uint8_t IRQ077MONHL;
              __IO uint8_t IRQ077MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ078MON;
        stc_intreq_irq078mon_field_t IRQ078MON_f;
        struct {
          union {
            __IO uint16_t IRQ078MONL;
            struct {
              __IO uint8_t IRQ078MONLL;
              __IO uint8_t IRQ078MONLH;
            };
          };
          union {
            __IO uint16_t IRQ078MONH;
            struct {
              __IO uint8_t IRQ078MONHL;
              __IO uint8_t IRQ078MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ079MON;
        stc_intreq_irq079mon_field_t IRQ079MON_f;
        struct {
          union {
            __IO uint16_t IRQ079MONL;
            struct {
              __IO uint8_t IRQ079MONLL;
              __IO uint8_t IRQ079MONLH;
            };
          };
          union {
            __IO uint16_t IRQ079MONH;
            struct {
              __IO uint8_t IRQ079MONHL;
              __IO uint8_t IRQ079MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ080MON;
        stc_intreq_irq080mon_field_t IRQ080MON_f;
        struct {
          union {
            __IO uint16_t IRQ080MONL;
            struct {
              __IO uint8_t IRQ080MONLL;
              __IO uint8_t IRQ080MONLH;
            };
          };
          union {
            __IO uint16_t IRQ080MONH;
            struct {
              __IO uint8_t IRQ080MONHL;
              __IO uint8_t IRQ080MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ081MON;
        stc_intreq_irq081mon_field_t IRQ081MON_f;
        struct {
          union {
            __IO uint16_t IRQ081MONL;
            struct {
              __IO uint8_t IRQ081MONLL;
              __IO uint8_t IRQ081MONLH;
            };
          };
          union {
            __IO uint16_t IRQ081MONH;
            struct {
              __IO uint8_t IRQ081MONHL;
              __IO uint8_t IRQ081MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ082MON;
        stc_intreq_irq082mon_field_t IRQ082MON_f;
        struct {
          union {
            __IO uint16_t IRQ082MONL;
            struct {
              __IO uint8_t IRQ082MONLL;
              __IO uint8_t IRQ082MONLH;
            };
          };
          union {
            __IO uint16_t IRQ082MONH;
            struct {
              __IO uint8_t IRQ082MONHL;
              __IO uint8_t IRQ082MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ083MON;
        stc_intreq_irq083mon_field_t IRQ083MON_f;
        struct {
          union {
            __IO uint16_t IRQ083MONL;
            struct {
              __IO uint8_t IRQ083MONLL;
              __IO uint8_t IRQ083MONLH;
            };
          };
          union {
            __IO uint16_t IRQ083MONH;
            struct {
              __IO uint8_t IRQ083MONHL;
              __IO uint8_t IRQ083MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ084MON;
        stc_intreq_irq084mon_field_t IRQ084MON_f;
        struct {
          union {
            __IO uint16_t IRQ084MONL;
            struct {
              __IO uint8_t IRQ084MONLL;
              __IO uint8_t IRQ084MONLH;
            };
          };
          union {
            __IO uint16_t IRQ084MONH;
            struct {
              __IO uint8_t IRQ084MONHL;
              __IO uint8_t IRQ084MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ085MON;
        stc_intreq_irq085mon_field_t IRQ085MON_f;
