MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2H46G0AGB3000A/mcu.h
#define bFM_CAN1_IF2CMSK_DATAB                    *((volatile  uint8_t *)(0x42C60840UL))
#define bFM4_CAN1_IF2CMSK_DATAB                   *((volatile  uint8_t *)(0x42C60840UL))
#define bFM_CAN1_IF2CMSK_DATAA                    *((volatile  uint8_t *)(0x42C60844UL))
#define bFM4_CAN1_IF2CMSK_DATAA                   *((volatile  uint8_t *)(0x42C60844UL))
#define bFM_CAN1_IF2CMSK_NEWDAT                   *((volatile  uint8_t *)(0x42C60848UL))
#define bFM4_CAN1_IF2CMSK_NEWDAT                  *((volatile  uint8_t *)(0x42C60848UL))
#define bFM_CAN1_IF2CMSK_CIP                      *((volatile  uint8_t *)(0x42C6084CUL))
#define bFM4_CAN1_IF2CMSK_CIP                     *((volatile  uint8_t *)(0x42C6084CUL))
#define bFM_CAN1_IF2CMSK_CONTROL                  *((volatile  uint8_t *)(0x42C60850UL))
#define bFM4_CAN1_IF2CMSK_CONTROL                 *((volatile  uint8_t *)(0x42C60850UL))
#define bFM_CAN1_IF2CMSK_ARB                      *((volatile  uint8_t *)(0x42C60854UL))
#define bFM4_CAN1_IF2CMSK_ARB                     *((volatile  uint8_t *)(0x42C60854UL))
#define bFM_CAN1_IF2CMSK_MASK                     *((volatile  uint8_t *)(0x42C60858UL))
#define bFM4_CAN1_IF2CMSK_MASK                    *((volatile  uint8_t *)(0x42C60858UL))
#define bFM_CAN1_IF2CMSK_WR_RD                    *((volatile  uint8_t *)(0x42C6085CUL))
#define bFM4_CAN1_IF2CMSK_WR_RD                   *((volatile  uint8_t *)(0x42C6085CUL))

#define bFM_CAN1_IF2CREQ_BUSY                     *((volatile  uint8_t *)(0x42C6083CUL))
#define bFM4_CAN1_IF2CREQ_BUSY                    *((volatile  uint8_t *)(0x42C6083CUL))

#define bFM_CAN1_IF2MCTR_EOB                      *((volatile  uint8_t *)(0x42C6099CUL))
#define bFM4_CAN1_IF2MCTR_EOB                     *((volatile  uint8_t *)(0x42C6099CUL))
#define bFM_CAN1_IF2MCTR_TXRQST                   *((volatile  uint8_t *)(0x42C609A0UL))
#define bFM4_CAN1_IF2MCTR_TXRQST                  *((volatile  uint8_t *)(0x42C609A0UL))
#define bFM_CAN1_IF2MCTR_RMTEN                    *((volatile  uint8_t *)(0x42C609A4UL))
#define bFM4_CAN1_IF2MCTR_RMTEN                   *((volatile  uint8_t *)(0x42C609A4UL))
#define bFM_CAN1_IF2MCTR_RXIE                     *((volatile  uint8_t *)(0x42C609A8UL))
#define bFM4_CAN1_IF2MCTR_RXIE                    *((volatile  uint8_t *)(0x42C609A8UL))
#define bFM_CAN1_IF2MCTR_TXIE                     *((volatile  uint8_t *)(0x42C609ACUL))
#define bFM4_CAN1_IF2MCTR_TXIE                    *((volatile  uint8_t *)(0x42C609ACUL))
#define bFM_CAN1_IF2MCTR_UMASK                    *((volatile  uint8_t *)(0x42C609B0UL))
#define bFM4_CAN1_IF2MCTR_UMASK                   *((volatile  uint8_t *)(0x42C609B0UL))
#define bFM_CAN1_IF2MCTR_INTPND                   *((volatile  uint8_t *)(0x42C609B4UL))
#define bFM4_CAN1_IF2MCTR_INTPND                  *((volatile  uint8_t *)(0x42C609B4UL))
#define bFM_CAN1_IF2MCTR_MSGLST                   *((volatile  uint8_t *)(0x42C609B8UL))
#define bFM4_CAN1_IF2MCTR_MSGLST                  *((volatile  uint8_t *)(0x42C609B8UL))
#define bFM_CAN1_IF2MCTR_NEWDAT                   *((volatile  uint8_t *)(0x42C609BCUL))
#define bFM4_CAN1_IF2MCTR_NEWDAT                  *((volatile  uint8_t *)(0x42C609BCUL))

#define bFM_CAN1_IF2MSK_MDIR                      *((volatile  uint8_t *)(0x42C608F8UL))
#define bFM4_CAN1_IF2MSK_MDIR                     *((volatile  uint8_t *)(0x42C608F8UL))
#define bFM_CAN1_IF2MSK_MXTD                      *((volatile  uint8_t *)(0x42C608FCUL))
#define bFM4_CAN1_IF2MSK_MXTD                     *((volatile  uint8_t *)(0x42C608FCUL))

#define bFM_CAN1_INTPND_INTPND1                   *((volatile  uint8_t *)(0x42C61400UL))
#define bFM4_CAN1_INTPND_INTPND1                  *((volatile  uint8_t *)(0x42C61400UL))
#define bFM_CAN1_INTPND_INTPND2                   *((volatile  uint8_t *)(0x42C61404UL))
#define bFM4_CAN1_INTPND_INTPND2                  *((volatile  uint8_t *)(0x42C61404UL))
#define bFM_CAN1_INTPND_INTPND3                   *((volatile  uint8_t *)(0x42C61408UL))
#define bFM4_CAN1_INTPND_INTPND3                  *((volatile  uint8_t *)(0x42C61408UL))
#define bFM_CAN1_INTPND_INTPND4                   *((volatile  uint8_t *)(0x42C6140CUL))
#define bFM4_CAN1_INTPND_INTPND4                  *((volatile  uint8_t *)(0x42C6140CUL))
#define bFM_CAN1_INTPND_INTPND5                   *((volatile  uint8_t *)(0x42C61410UL))
#define bFM4_CAN1_INTPND_INTPND5                  *((volatile  uint8_t *)(0x42C61410UL))
#define bFM_CAN1_INTPND_INTPND6                   *((volatile  uint8_t *)(0x42C61414UL))
#define bFM4_CAN1_INTPND_INTPND6                  *((volatile  uint8_t *)(0x42C61414UL))
#define bFM_CAN1_INTPND_INTPND7                   *((volatile  uint8_t *)(0x42C61418UL))
#define bFM4_CAN1_INTPND_INTPND7                  *((volatile  uint8_t *)(0x42C61418UL))
#define bFM_CAN1_INTPND_INTPND8                   *((volatile  uint8_t *)(0x42C6141CUL))
#define bFM4_CAN1_INTPND_INTPND8                  *((volatile  uint8_t *)(0x42C6141CUL))
#define bFM_CAN1_INTPND_INTPND9                   *((volatile  uint8_t *)(0x42C61420UL))
#define bFM4_CAN1_INTPND_INTPND9                  *((volatile  uint8_t *)(0x42C61420UL))
#define bFM_CAN1_INTPND_INTPND10                  *((volatile  uint8_t *)(0x42C61424UL))
#define bFM4_CAN1_INTPND_INTPND10                 *((volatile  uint8_t *)(0x42C61424UL))
#define bFM_CAN1_INTPND_INTPND11                  *((volatile  uint8_t *)(0x42C61428UL))
#define bFM4_CAN1_INTPND_INTPND11                 *((volatile  uint8_t *)(0x42C61428UL))
#define bFM_CAN1_INTPND_INTPND12                  *((volatile  uint8_t *)(0x42C6142CUL))
#define bFM4_CAN1_INTPND_INTPND12                 *((volatile  uint8_t *)(0x42C6142CUL))
#define bFM_CAN1_INTPND_INTPND13                  *((volatile  uint8_t *)(0x42C61430UL))
#define bFM4_CAN1_INTPND_INTPND13                 *((volatile  uint8_t *)(0x42C61430UL))
#define bFM_CAN1_INTPND_INTPND14                  *((volatile  uint8_t *)(0x42C61434UL))
#define bFM4_CAN1_INTPND_INTPND14                 *((volatile  uint8_t *)(0x42C61434UL))
#define bFM_CAN1_INTPND_INTPND15                  *((volatile  uint8_t *)(0x42C61438UL))
#define bFM4_CAN1_INTPND_INTPND15                 *((volatile  uint8_t *)(0x42C61438UL))
#define bFM_CAN1_INTPND_INTPND16                  *((volatile  uint8_t *)(0x42C6143CUL))
#define bFM4_CAN1_INTPND_INTPND16                 *((volatile  uint8_t *)(0x42C6143CUL))
#define bFM_CAN1_INTPND_INTPND17                  *((volatile  uint8_t *)(0x42C61440UL))
#define bFM4_CAN1_INTPND_INTPND17                 *((volatile  uint8_t *)(0x42C61440UL))
#define bFM_CAN1_INTPND_INTPND18                  *((volatile  uint8_t *)(0x42C61444UL))
#define bFM4_CAN1_INTPND_INTPND18                 *((volatile  uint8_t *)(0x42C61444UL))
#define bFM_CAN1_INTPND_INTPND19                  *((volatile  uint8_t *)(0x42C61448UL))
#define bFM4_CAN1_INTPND_INTPND19                 *((volatile  uint8_t *)(0x42C61448UL))
#define bFM_CAN1_INTPND_INTPND20                  *((volatile  uint8_t *)(0x42C6144CUL))
#define bFM4_CAN1_INTPND_INTPND20                 *((volatile  uint8_t *)(0x42C6144CUL))
#define bFM_CAN1_INTPND_INTPND21                  *((volatile  uint8_t *)(0x42C61450UL))
#define bFM4_CAN1_INTPND_INTPND21                 *((volatile  uint8_t *)(0x42C61450UL))
#define bFM_CAN1_INTPND_INTPND22                  *((volatile  uint8_t *)(0x42C61454UL))
#define bFM4_CAN1_INTPND_INTPND22                 *((volatile  uint8_t *)(0x42C61454UL))
#define bFM_CAN1_INTPND_INTPND23                  *((volatile  uint8_t *)(0x42C61458UL))
#define bFM4_CAN1_INTPND_INTPND23                 *((volatile  uint8_t *)(0x42C61458UL))
#define bFM_CAN1_INTPND_INTPND24                  *((volatile  uint8_t *)(0x42C6145CUL))
#define bFM4_CAN1_INTPND_INTPND24                 *((volatile  uint8_t *)(0x42C6145CUL))
#define bFM_CAN1_INTPND_INTPND25                  *((volatile  uint8_t *)(0x42C61460UL))
#define bFM4_CAN1_INTPND_INTPND25                 *((volatile  uint8_t *)(0x42C61460UL))
#define bFM_CAN1_INTPND_INTPND26                  *((volatile  uint8_t *)(0x42C61464UL))
#define bFM4_CAN1_INTPND_INTPND26                 *((volatile  uint8_t *)(0x42C61464UL))
#define bFM_CAN1_INTPND_INTPND27                  *((volatile  uint8_t *)(0x42C61468UL))
#define bFM4_CAN1_INTPND_INTPND27                 *((volatile  uint8_t *)(0x42C61468UL))
#define bFM_CAN1_INTPND_INTPND28                  *((volatile  uint8_t *)(0x42C6146CUL))
#define bFM4_CAN1_INTPND_INTPND28                 *((volatile  uint8_t *)(0x42C6146CUL))
#define bFM_CAN1_INTPND_INTPND29                  *((volatile  uint8_t *)(0x42C61470UL))
#define bFM4_CAN1_INTPND_INTPND29                 *((volatile  uint8_t *)(0x42C61470UL))
#define bFM_CAN1_INTPND_INTPND30                  *((volatile  uint8_t *)(0x42C61474UL))
#define bFM4_CAN1_INTPND_INTPND30                 *((volatile  uint8_t *)(0x42C61474UL))
#define bFM_CAN1_INTPND_INTPND31                  *((volatile  uint8_t *)(0x42C61478UL))
#define bFM4_CAN1_INTPND_INTPND31                 *((volatile  uint8_t *)(0x42C61478UL))
#define bFM_CAN1_INTPND_INTPND32                  *((volatile  uint8_t *)(0x42C6147CUL))
#define bFM4_CAN1_INTPND_INTPND32                 *((volatile  uint8_t *)(0x42C6147CUL))

#define bFM_CAN1_MSGVAL_MSGVAL1                   *((volatile  uint8_t *)(0x42C61600UL))
#define bFM4_CAN1_MSGVAL_MSGVAL1                  *((volatile  uint8_t *)(0x42C61600UL))
#define bFM_CAN1_MSGVAL_MSGVAL2                   *((volatile  uint8_t *)(0x42C61604UL))
#define bFM4_CAN1_MSGVAL_MSGVAL2                  *((volatile  uint8_t *)(0x42C61604UL))
#define bFM_CAN1_MSGVAL_MSGVAL3                   *((volatile  uint8_t *)(0x42C61608UL))
#define bFM4_CAN1_MSGVAL_MSGVAL3                  *((volatile  uint8_t *)(0x42C61608UL))
#define bFM_CAN1_MSGVAL_MSGVAL4                   *((volatile  uint8_t *)(0x42C6160CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL4                  *((volatile  uint8_t *)(0x42C6160CUL))
#define bFM_CAN1_MSGVAL_MSGVAL5                   *((volatile  uint8_t *)(0x42C61610UL))
#define bFM4_CAN1_MSGVAL_MSGVAL5                  *((volatile  uint8_t *)(0x42C61610UL))
#define bFM_CAN1_MSGVAL_MSGVAL6                   *((volatile  uint8_t *)(0x42C61614UL))
#define bFM4_CAN1_MSGVAL_MSGVAL6                  *((volatile  uint8_t *)(0x42C61614UL))
#define bFM_CAN1_MSGVAL_MSGVAL7                   *((volatile  uint8_t *)(0x42C61618UL))
#define bFM4_CAN1_MSGVAL_MSGVAL7                  *((volatile  uint8_t *)(0x42C61618UL))
#define bFM_CAN1_MSGVAL_MSGVAL8                   *((volatile  uint8_t *)(0x42C6161CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL8                  *((volatile  uint8_t *)(0x42C6161CUL))
#define bFM_CAN1_MSGVAL_MSGVAL9                   *((volatile  uint8_t *)(0x42C61620UL))
#define bFM4_CAN1_MSGVAL_MSGVAL9                  *((volatile  uint8_t *)(0x42C61620UL))
#define bFM_CAN1_MSGVAL_MSGVAL10                  *((volatile  uint8_t *)(0x42C61624UL))
#define bFM4_CAN1_MSGVAL_MSGVAL10                 *((volatile  uint8_t *)(0x42C61624UL))
#define bFM_CAN1_MSGVAL_MSGVAL11                  *((volatile  uint8_t *)(0x42C61628UL))
#define bFM4_CAN1_MSGVAL_MSGVAL11                 *((volatile  uint8_t *)(0x42C61628UL))
#define bFM_CAN1_MSGVAL_MSGVAL12                  *((volatile  uint8_t *)(0x42C6162CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL12                 *((volatile  uint8_t *)(0x42C6162CUL))
#define bFM_CAN1_MSGVAL_MSGVAL13                  *((volatile  uint8_t *)(0x42C61630UL))
#define bFM4_CAN1_MSGVAL_MSGVAL13                 *((volatile  uint8_t *)(0x42C61630UL))
#define bFM_CAN1_MSGVAL_MSGVAL14                  *((volatile  uint8_t *)(0x42C61634UL))
#define bFM4_CAN1_MSGVAL_MSGVAL14                 *((volatile  uint8_t *)(0x42C61634UL))
#define bFM_CAN1_MSGVAL_MSGVAL15                  *((volatile  uint8_t *)(0x42C61638UL))
#define bFM4_CAN1_MSGVAL_MSGVAL15                 *((volatile  uint8_t *)(0x42C61638UL))
#define bFM_CAN1_MSGVAL_MSGVAL16                  *((volatile  uint8_t *)(0x42C6163CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL16                 *((volatile  uint8_t *)(0x42C6163CUL))
#define bFM_CAN1_MSGVAL_MSGVAL17                  *((volatile  uint8_t *)(0x42C61640UL))
#define bFM4_CAN1_MSGVAL_MSGVAL17                 *((volatile  uint8_t *)(0x42C61640UL))
#define bFM_CAN1_MSGVAL_MSGVAL18                  *((volatile  uint8_t *)(0x42C61644UL))
#define bFM4_CAN1_MSGVAL_MSGVAL18                 *((volatile  uint8_t *)(0x42C61644UL))
#define bFM_CAN1_MSGVAL_MSGVAL19                  *((volatile  uint8_t *)(0x42C61648UL))
#define bFM4_CAN1_MSGVAL_MSGVAL19                 *((volatile  uint8_t *)(0x42C61648UL))
#define bFM_CAN1_MSGVAL_MSGVAL20                  *((volatile  uint8_t *)(0x42C6164CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL20                 *((volatile  uint8_t *)(0x42C6164CUL))
#define bFM_CAN1_MSGVAL_MSGVAL21                  *((volatile  uint8_t *)(0x42C61650UL))
#define bFM4_CAN1_MSGVAL_MSGVAL21                 *((volatile  uint8_t *)(0x42C61650UL))
#define bFM_CAN1_MSGVAL_MSGVAL22                  *((volatile  uint8_t *)(0x42C61654UL))
#define bFM4_CAN1_MSGVAL_MSGVAL22                 *((volatile  uint8_t *)(0x42C61654UL))
#define bFM_CAN1_MSGVAL_MSGVAL23                  *((volatile  uint8_t *)(0x42C61658UL))
#define bFM4_CAN1_MSGVAL_MSGVAL23                 *((volatile  uint8_t *)(0x42C61658UL))
#define bFM_CAN1_MSGVAL_MSGVAL24                  *((volatile  uint8_t *)(0x42C6165CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL24                 *((volatile  uint8_t *)(0x42C6165CUL))
#define bFM_CAN1_MSGVAL_MSGVAL25                  *((volatile  uint8_t *)(0x42C61660UL))
#define bFM4_CAN1_MSGVAL_MSGVAL25                 *((volatile  uint8_t *)(0x42C61660UL))
#define bFM_CAN1_MSGVAL_MSGVAL26                  *((volatile  uint8_t *)(0x42C61664UL))
#define bFM4_CAN1_MSGVAL_MSGVAL26                 *((volatile  uint8_t *)(0x42C61664UL))
#define bFM_CAN1_MSGVAL_MSGVAL27                  *((volatile  uint8_t *)(0x42C61668UL))
#define bFM4_CAN1_MSGVAL_MSGVAL27                 *((volatile  uint8_t *)(0x42C61668UL))
#define bFM_CAN1_MSGVAL_MSGVAL28                  *((volatile  uint8_t *)(0x42C6166CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL28                 *((volatile  uint8_t *)(0x42C6166CUL))
#define bFM_CAN1_MSGVAL_MSGVAL29                  *((volatile  uint8_t *)(0x42C61670UL))
#define bFM4_CAN1_MSGVAL_MSGVAL29                 *((volatile  uint8_t *)(0x42C61670UL))
#define bFM_CAN1_MSGVAL_MSGVAL30                  *((volatile  uint8_t *)(0x42C61674UL))
#define bFM4_CAN1_MSGVAL_MSGVAL30                 *((volatile  uint8_t *)(0x42C61674UL))
#define bFM_CAN1_MSGVAL_MSGVAL31                  *((volatile  uint8_t *)(0x42C61678UL))
#define bFM4_CAN1_MSGVAL_MSGVAL31                 *((volatile  uint8_t *)(0x42C61678UL))
#define bFM_CAN1_MSGVAL_MSGVAL32                  *((volatile  uint8_t *)(0x42C6167CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL32                 *((volatile  uint8_t *)(0x42C6167CUL))

#define bFM_CAN1_NEWDT_NEWDAT1                    *((volatile  uint8_t *)(0x42C61200UL))
#define bFM4_CAN1_NEWDT_NEWDAT1                   *((volatile  uint8_t *)(0x42C61200UL))
#define bFM_CAN1_NEWDT_NEWDAT2                    *((volatile  uint8_t *)(0x42C61204UL))
#define bFM4_CAN1_NEWDT_NEWDAT2                   *((volatile  uint8_t *)(0x42C61204UL))
#define bFM_CAN1_NEWDT_NEWDAT3                    *((volatile  uint8_t *)(0x42C61208UL))
#define bFM4_CAN1_NEWDT_NEWDAT3                   *((volatile  uint8_t *)(0x42C61208UL))
#define bFM_CAN1_NEWDT_NEWDAT4                    *((volatile  uint8_t *)(0x42C6120CUL))
#define bFM4_CAN1_NEWDT_NEWDAT4                   *((volatile  uint8_t *)(0x42C6120CUL))
#define bFM_CAN1_NEWDT_NEWDAT5                    *((volatile  uint8_t *)(0x42C61210UL))
#define bFM4_CAN1_NEWDT_NEWDAT5                   *((volatile  uint8_t *)(0x42C61210UL))
#define bFM_CAN1_NEWDT_NEWDAT6                    *((volatile  uint8_t *)(0x42C61214UL))
#define bFM4_CAN1_NEWDT_NEWDAT6                   *((volatile  uint8_t *)(0x42C61214UL))
#define bFM_CAN1_NEWDT_NEWDAT7                    *((volatile  uint8_t *)(0x42C61218UL))
#define bFM4_CAN1_NEWDT_NEWDAT7                   *((volatile  uint8_t *)(0x42C61218UL))
#define bFM_CAN1_NEWDT_NEWDAT8                    *((volatile  uint8_t *)(0x42C6121CUL))
#define bFM4_CAN1_NEWDT_NEWDAT8                   *((volatile  uint8_t *)(0x42C6121CUL))
#define bFM_CAN1_NEWDT_NEWDAT9                    *((volatile  uint8_t *)(0x42C61220UL))
#define bFM4_CAN1_NEWDT_NEWDAT9                   *((volatile  uint8_t *)(0x42C61220UL))
#define bFM_CAN1_NEWDT_NEWDAT10                   *((volatile  uint8_t *)(0x42C61224UL))
#define bFM4_CAN1_NEWDT_NEWDAT10                  *((volatile  uint8_t *)(0x42C61224UL))
#define bFM_CAN1_NEWDT_NEWDAT11                   *((volatile  uint8_t *)(0x42C61228UL))
#define bFM4_CAN1_NEWDT_NEWDAT11                  *((volatile  uint8_t *)(0x42C61228UL))
#define bFM_CAN1_NEWDT_NEWDAT12                   *((volatile  uint8_t *)(0x42C6122CUL))
#define bFM4_CAN1_NEWDT_NEWDAT12                  *((volatile  uint8_t *)(0x42C6122CUL))
#define bFM_CAN1_NEWDT_NEWDAT13                   *((volatile  uint8_t *)(0x42C61230UL))
#define bFM4_CAN1_NEWDT_NEWDAT13                  *((volatile  uint8_t *)(0x42C61230UL))
#define bFM_CAN1_NEWDT_NEWDAT14                   *((volatile  uint8_t *)(0x42C61234UL))
#define bFM4_CAN1_NEWDT_NEWDAT14                  *((volatile  uint8_t *)(0x42C61234UL))
#define bFM_CAN1_NEWDT_NEWDAT15                   *((volatile  uint8_t *)(0x42C61238UL))
#define bFM4_CAN1_NEWDT_NEWDAT15                  *((volatile  uint8_t *)(0x42C61238UL))
#define bFM_CAN1_NEWDT_NEWDAT16                   *((volatile  uint8_t *)(0x42C6123CUL))
#define bFM4_CAN1_NEWDT_NEWDAT16                  *((volatile  uint8_t *)(0x42C6123CUL))
#define bFM_CAN1_NEWDT_NEWDAT17                   *((volatile  uint8_t *)(0x42C61240UL))
#define bFM4_CAN1_NEWDT_NEWDAT17                  *((volatile  uint8_t *)(0x42C61240UL))
#define bFM_CAN1_NEWDT_NEWDAT18                   *((volatile  uint8_t *)(0x42C61244UL))
#define bFM4_CAN1_NEWDT_NEWDAT18                  *((volatile  uint8_t *)(0x42C61244UL))
#define bFM_CAN1_NEWDT_NEWDAT19                   *((volatile  uint8_t *)(0x42C61248UL))
#define bFM4_CAN1_NEWDT_NEWDAT19                  *((volatile  uint8_t *)(0x42C61248UL))
#define bFM_CAN1_NEWDT_NEWDAT20                   *((volatile  uint8_t *)(0x42C6124CUL))
#define bFM4_CAN1_NEWDT_NEWDAT20                  *((volatile  uint8_t *)(0x42C6124CUL))
#define bFM_CAN1_NEWDT_NEWDAT21                   *((volatile  uint8_t *)(0x42C61250UL))
#define bFM4_CAN1_NEWDT_NEWDAT21                  *((volatile  uint8_t *)(0x42C61250UL))
#define bFM_CAN1_NEWDT_NEWDAT22                   *((volatile  uint8_t *)(0x42C61254UL))
#define bFM4_CAN1_NEWDT_NEWDAT22                  *((volatile  uint8_t *)(0x42C61254UL))
#define bFM_CAN1_NEWDT_NEWDAT23                   *((volatile  uint8_t *)(0x42C61258UL))
#define bFM4_CAN1_NEWDT_NEWDAT23                  *((volatile  uint8_t *)(0x42C61258UL))
#define bFM_CAN1_NEWDT_NEWDAT24                   *((volatile  uint8_t *)(0x42C6125CUL))
#define bFM4_CAN1_NEWDT_NEWDAT24                  *((volatile  uint8_t *)(0x42C6125CUL))
#define bFM_CAN1_NEWDT_NEWDAT25                   *((volatile  uint8_t *)(0x42C61260UL))
#define bFM4_CAN1_NEWDT_NEWDAT25                  *((volatile  uint8_t *)(0x42C61260UL))
#define bFM_CAN1_NEWDT_NEWDAT26                   *((volatile  uint8_t *)(0x42C61264UL))
#define bFM4_CAN1_NEWDT_NEWDAT26                  *((volatile  uint8_t *)(0x42C61264UL))
#define bFM_CAN1_NEWDT_NEWDAT27                   *((volatile  uint8_t *)(0x42C61268UL))
#define bFM4_CAN1_NEWDT_NEWDAT27                  *((volatile  uint8_t *)(0x42C61268UL))
#define bFM_CAN1_NEWDT_NEWDAT28                   *((volatile  uint8_t *)(0x42C6126CUL))
#define bFM4_CAN1_NEWDT_NEWDAT28                  *((volatile  uint8_t *)(0x42C6126CUL))
#define bFM_CAN1_NEWDT_NEWDAT29                   *((volatile  uint8_t *)(0x42C61270UL))
#define bFM4_CAN1_NEWDT_NEWDAT29                  *((volatile  uint8_t *)(0x42C61270UL))
#define bFM_CAN1_NEWDT_NEWDAT30                   *((volatile  uint8_t *)(0x42C61274UL))
#define bFM4_CAN1_NEWDT_NEWDAT30                  *((volatile  uint8_t *)(0x42C61274UL))
#define bFM_CAN1_NEWDT_NEWDAT31                   *((volatile  uint8_t *)(0x42C61278UL))
#define bFM4_CAN1_NEWDT_NEWDAT31                  *((volatile  uint8_t *)(0x42C61278UL))
#define bFM_CAN1_NEWDT_NEWDAT32                   *((volatile  uint8_t *)(0x42C6127CUL))
#define bFM4_CAN1_NEWDT_NEWDAT32                  *((volatile  uint8_t *)(0x42C6127CUL))

